//#include "Header.h"
//
//// 연습 문제2
////	// 3 6 9 게임을 구현하시요.
////	// (범위는 1부터 30까지)
////	// ex) 1 2 짝 4 5 짝 7 8 짝...
//
//int main()
//{
//	for (int i = 1; i <= 30; i++)
//	{
//		if (i / 10 == 3 ||i % 10 == 3 || i % 10 == 6 || i % 10 == 9)
//		{
//			cout << "짝 ";
//		}
//		else
//		{
//			cout << i << " ";
//		}
//	}
//
//	// 숫자를 입력하면 그 숫자의 약수를 출력하는 프로그램을 구현합니다.
//	// ex) 숫자를 입력해주세요(정수) : 15
//	// 1 3 5 15
//	cout << endl;
//
//	int number;
//
//	cout << "숫자를 입력해주세요 : ";
//	cin >> number;
//
//	for (int i = 1; i <= number; i++)
//	{
//		if (number % i == 0)
//		{
//			cout << i << " ";
//		}
//	}
//	return 0;
//}
//
